Repository: fredldotme/snapz0r
Catalog: po/*.po
Languages: nl

source: Info
nl: Informatie

source: Enable Snaps
nl: Snaps inschakelen

source: Ubuntu One E-Mail address
nl: Ubuntu One-e-mailadres

source: Password
nl: Wachtwoord

source: Login
nl: Inloggen

source: Cancel
nl: Annuleren

source: Checking functionality...
nl: Bezig met functiecontrole…

source: Search
nl: Zoeken

source: Re-install support
nl: Herinstalleren

source: Search for snaps:
nl: Zoeken naar snaps:

source: No Snaps installed yet
nl: Er zijn nog geen snaps geïnstalleerd

source: Details for %1
nl: Details van %1

source: Install
nl: Installeren

source: Remove
nl: Verwijderen

source: Store Website
nl: Appwinkelpagina
